public class Main {
    public static void main(String[] args) {
        /*
        1) გაუცვალეთ ორ მთელ რიცხვს ადგილები დამატებითი ცვლადის გამოყენებით
           a) ახლა ცადეთ დმატებითი ცვლადის გამოყენების გარეშე
         */
        int x = 1;
        int y = 2;
        int c = x;
        x = y;
        y = c;
        System.out.println(x);
        System.out.println(y);


        /*
        2) მოცემული გაქვთ არამთელი რიცხვი, დაბეჭდეთ ამ არამთელი რიცხვის მხოლოდ არამთელი
           ნაწილი. მაგალითად თუ შემოგივიდათ 10.234 მაშინ უნდა დაბეჭდოთ 0.234.
         */
        double j = 10.213;
        double pas_1 = j % 1;
        System.out.println(pas_1);


        /*
        3) მოცემული გაქვთ მთელი რიცხვი, დაადგინეთ არის თუ არა ეს რიცხვი სამნიშნა. (რიცხვი
           არის მთელი)
         */

        int num_1 = 1234;

        if (num_1 / 100 > 0){
            System.out.println("samnishnaa");
        }else if (num_1 / 1000 >0){
            System.out.println("araa samnishna");
        }else{
            System.out.println("araa samnishna");
        }

        /*
        4) მოცემული გაქვთ სიმბოლო (char) რომელიც არის პატარა მაგ: a, b, c… თქვენი მიზანია ეს
           რიცხვი გადაიყვანოთ თავის დიდ ფორმაში მაგ: A, B, C… გამოიყენეთ რიცხვები და არ
           გამოიყენოთ ჯავაში ჩაშენებული მეთოდები. ანუ თუ შემოგივიდათ r დაბეჭდეთ R
         */

        char one = 'a';
        one = 'A';
        System.out.println(one);

        /*
        5) მოცემული გაქვთ არამთელი რიცხვი, თქვენი მიზანია დაამრგვალოთ ის უახლოეს მთელ
        რიცხვამდე. თუ შემოგდით 14.4 -> 14 ხოლო 11.5 -> 12
         */

        double num_2 = 124.123;


        if ((num_2 % 1) > 0.5){
            System.out.println(num_2 + (1 - (num_2 % 1)));
        }else{
            System.out.println(num_2 - (num_2 % 1));
        }

        /*
        6) მოცემული გაქვთ სამი რიცხვი a,b და k. დაადგინეთ რამდენი k სიგრძის გვერდიანი
           კვადრატია საკმარისი იმისთვის, რომ მთლიანად დაიფაროს a * b ზომის ფართობი.
           (თავისთავად შესაძლებელია გადაცდეს კვადრატები ფართობს)
         */

        int a = 10;
        int b = 20;
        int s_1 = a * b;
        int k = 5;
        int s_2 = k * k;
        System.out.println(s_1 / s_2);


        /*
        7) მოცემული გაქვთ რაიმე დადებითი რიცხვი რომელიც წარმოადგენს წამებს. თქვენი მიზანია
           ეს წამები გადაიყვანოთ საათებში, წუთებსა და წამებში. მაგალითად თუ გაქვთ 2665 მაშინ
           უნდა დაბეჭდოთ “1:1:5”
         */

        int wami = 99888987;
        int saati = wami / 3600;
        int wuti = (wami - saati * 3600) / 60;
        int wami_1 = wami - saati * 3600 - wuti * 60;
        System.out.println(saati + ":" + wuti + ":" + wami_1);


        /*
        8) შეასრულეთ იგივე რაც 7 სავარჯიშოში if-ების გარეშე
         */

        System.out.println(saati + ":" + wuti + ":" + wami_1);





    }
}